In [1]:
import pandas as pd

surveys = pd.read_csv('StackOverflowDeveloperSurvey.csv', usecols=['Salary']).squeeze().dropna()
surveys.head()

2     113750.0
14    100000.0
17    130000.0
18     82500.0
22    100764.0
Name: Salary, dtype: float64

In [2]:
len(surveys)

12891

In [3]:
surveysIncrease = surveys * 0.03
surveysIncrease.head()

2     3412.50
14    3000.00
17    3900.00
18    2475.00
22    3022.92
Name: Salary, dtype: float64

In [4]:
surveysAfterIncrease = surveys + surveysIncrease
surveysAfterIncrease.head()

2     117162.50
14    103000.00
17    133900.00
18     84975.00
22    103786.92
Name: Salary, dtype: float64

In [5]:
surveysTime = pd.read_csv('StackOverflowDeveloperSurvey2018.csv', low_memory=False, usecols=['HoursOutside']).squeeze().dropna()
surveysTime.head()

0             1 - 2 hours
1         30 - 59 minutes
3    Less than 30 minutes
4             1 - 2 hours
5         30 - 59 minutes
Name: HoursOutside, dtype: object

In [6]:
surveysTime.value_counts()

HoursOutside
1 - 2 hours             27788
30 - 59 minutes         24002
Less than 30 minutes    11223
3 - 4 hours              7186
Over 4 hours             1825
Name: count, dtype: int64

In [7]:
surveysTime = surveysTime.str.lower()
surveysTime.head()

0             1 - 2 hours
1         30 - 59 minutes
3    less than 30 minutes
4             1 - 2 hours
5         30 - 59 minutes
Name: HoursOutside, dtype: object

In [8]:
surveysTime = surveysTime.apply(lambda x: x.upper())
surveysTime.head()

0             1 - 2 HOURS
1         30 - 59 MINUTES
3    LESS THAN 30 MINUTES
4             1 - 2 HOURS
5         30 - 59 MINUTES
Name: HoursOutside, dtype: object

In [9]:
def ChangeDescription(sample):
    if sample == 'LESS THAN 30 MINUTES':
        return 'LESS THAN ONE HOUR'
    else:
        return sample

In [10]:
ChangeDescription('LESS THAN 30 MINUTES')

'LESS THAN ONE HOUR'

In [11]:
ChangeDescription('MORE THAN 5 DAYS')

'MORE THAN 5 DAYS'

In [12]:
surveysTime = surveysTime.apply(ChangeDescription)
surveysTime.head()

0           1 - 2 HOURS
1       30 - 59 MINUTES
3    LESS THAN ONE HOUR
4           1 - 2 HOURS
5       30 - 59 MINUTES
Name: HoursOutside, dtype: object